org/recipes/coconut-chana-saag.org
#+TITLE: Coconut Chana Saag
#+DATE: 2019-02-19
#+SETUPFILE: ../recipe.setup

* Ingredients
  - 2 tablespoons coconut oil
  - 1 onion
  - 3 cloves garlic
  - 2 tablespoons minced ginger
  - 2 tablespoons curry powder - need more
  - 1 teaspoon salt
  - Black pepper
  - 1/2 teaspoon anise seed (or crushed fennel seeds)
  - 1/2 teaspoon garam masala
  - 1/2 teaspoon ground cumin
  - 1/2 teaspoon cayenne
  - 1 can whole tomatoes
  - 2 cans chickpeas
  - 200g chopped kale
  - 1 can coconut milk
  - 2 tablespoons lime juice
  - Basmati rice, mango chutney, coriander for serving

* Instructions
  1. Preheat pot over medium heat and add coconut oil and onions. Saute for 5-7 min
  2. Add garlic, ginger and cook for 30s, before adding curry powder, salt, pepper, anise seeds, garam masala, cumin, cayenne. Toast spices for a bit
  3. Add tomato juice from can and mix in. Then squish the tomatos in your hand to mash them and add to pot. Add chick peas also
  4. Cover pan and simmer for 10 min, stirring occasionally
  5. Stir in kale until wilted then simmer for another 5 min
  6. Add coconut milk and heat through. Add lime juice and season
  7. Serve with rice, chutney and corriander
