recipes/coconut-chana-saag.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Coconut Chana Saag</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Coconut Chana Saag</h1>

<div id="outline-container-org7d770b7" class="outline-2">
<h2 id="org7d770b7">Ingredients</h2>
<div class="outline-text-2" id="text-org7d770b7">
<ul class="org-ul">
<li>2 tablespoons coconut oil</li>
<li>1 onion</li>
<li>3 cloves garlic</li>
<li>2 tablespoons minced ginger</li>
<li>2 tablespoons curry powder - need more</li>
<li>1 teaspoon salt</li>
<li>Black pepper</li>
<li>1/2 teaspoon anise seed (or crushed fennel seeds)</li>
<li>1/2 teaspoon garam masala</li>
<li>1/2 teaspoon ground cumin</li>
<li>1/2 teaspoon cayenne</li>
<li>1 can whole tomatoes</li>
<li>2 cans chickpeas</li>
<li>200g chopped kale</li>
<li>1 can coconut milk</li>
<li>2 tablespoons lime juice</li>
<li>Basmati rice, mango chutney, coriander for serving</li>
</ul>
</div>
</div>

<div id="outline-container-org4862033" class="outline-2">
<h2 id="org4862033">Method</h2>
<div class="outline-text-2" id="text-org4862033">
<ol class="org-ol">
<li>Preheat pot over medium heat and add coconut oil and onions. Saute for 5-7 min</li>
<li>Add garlic, ginger and cook for 30s, before adding curry powder, salt, pepper, anise seeds, garam masala, cumin, cayenne. Toast spices for a bit</li>
<li>Add tomato juice from can and mix in. Then squish the tomatos in your hand to mash them and add to pot. Add chick peas also</li>
<li>Cover pan and simmer for 10 min, stirring occasionally</li>
<li>Stir in kale until wilted then simmer for another 5 min</li>
<li>Add coconut milk and heat through. Add lime juice and season</li>
<li>Serve with rice, chutney and corriander</li>
</ol>
</div>
</div>
</div>
</body>
</html>
